---
kind: other
id: Methods.T:Autodesk.Revit.DB.FailureHandlingOptions
source: html/01e13110-3961-7f07-1ad0-d485d5b933b6.htm
---
# FailureHandlingOptions Methods

Obtains the flag indicating if all posted failures should be removed silently when transaction is being rolled back.